app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "artem-tishchenko-2002@mail.ru"], ["LIMIT", 1]]
---
  def create
    user = User.find_by_email(user_params[:email])