app/controllers/register_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "artem"], ["password_digest", "[FILTERED]"], ["email", "artem-tishchenko-2002@mail.ru"], ["created_at", "2022-12-26 13:39:20.791566"], ["updated_at", "2022-12-26 13:39:20.791566"]]